busy-app/busybar-firmware/lib/simplicity_sdk_new/devices/platform/Device/SiliconLabs/EFR32FG2D/Include/efr32fg2d_pcnt.h
/* Bit fields for PCNT STATUS */
#define _PCNT_STATUS_RESETVALUE                 0x00000000UL                                /**< Default value for PCNT_STATUS               */
#define _PCNT_STATUS_MASK                       0x0000001FUL                                /**< Mask for PCNT_STATUS                        */
#define PCNT_STATUS_DIR                         (0x1UL << 0)                                /**< Current Counter Direction                   */
#define _PCNT_STATUS_DIR_SHIFT                  0                                           /**< Shift value for PCNT_DIR                    */
#define _PCNT_STATUS_DIR_MASK                   0x1UL                                       /**< Bit mask for PCNT_DIR                       */
#define _PCNT_STATUS_DIR_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for PCNT_STATUS                */
#define _PCNT_STATUS_DIR_UP                     0x00000000UL                                /**< Mode UP for PCNT_STATUS                     */
#define _PCNT_STATUS_DIR_DOWN                   0x00000001UL                                /**< Mode DOWN for PCNT_STATUS                   */
#define PCNT_STATUS_DIR_DEFAULT                 (_PCNT_STATUS_DIR_DEFAULT << 0)             /**< Shifted mode DEFAULT for PCNT_STATUS        */
#define PCNT_STATUS_DIR_UP                      (_PCNT_STATUS_DIR_UP << 0)                  /**< Shifted mode UP for PCNT_STATUS             */
#define PCNT_STATUS_DIR_DOWN                    (_PCNT_STATUS_DIR_DOWN << 0)                /**< Shifted mode DOWN for PCNT_STATUS           */
#define PCNT_STATUS_TOPBV                       (0x1UL << 1)                                /**< TOP Buffer Valid                            */
#define _PCNT_STATUS_TOPBV_SHIFT                1                                           /**< Shift value for PCNT_TOPBV                  */
#define _PCNT_STATUS_TOPBV_MASK                 0x2UL                                       /**< Bit mask for PCNT_TOPBV                     */
#define _PCNT_STATUS_TOPBV_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PCNT_STATUS                */
#define PCNT_STATUS_TOPBV_DEFAULT               (_PCNT_STATUS_TOPBV_DEFAULT << 1)           /**< Shifted mode DEFAULT for PCNT_STATUS        */
#define PCNT_STATUS_PCNTLOCKSTATUS              (0x1UL << 2)                                /**< Lock Status                                 */
#define _PCNT_STATUS_PCNTLOCKSTATUS_SHIFT       2                                           /**< Shift value for PCNT_PCNTLOCKSTATUS         */
#define _PCNT_STATUS_PCNTLOCKSTATUS_MASK        0x4UL                                       /**< Bit mask for PCNT_PCNTLOCKSTATUS            */
#define _PCNT_STATUS_PCNTLOCKSTATUS_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for PCNT_STATUS                */
#define _PCNT_STATUS_PCNTLOCKSTATUS_UNLOCKED    0x00000000UL                                /**< Mode UNLOCKED for PCNT_STATUS               */
#define _PCNT_STATUS_PCNTLOCKSTATUS_LOCKED      0x00000001UL                                /**< Mode LOCKED for PCNT_STATUS                 */
#define PCNT_STATUS_PCNTLOCKSTATUS_DEFAULT      (_PCNT_STATUS_PCNTLOCKSTATUS_DEFAULT << 2)  /**< Shifted mode DEFAULT for PCNT_STATUS        */
#define PCNT_STATUS_PCNTLOCKSTATUS_UNLOCKED     (_PCNT_STATUS_PCNTLOCKSTATUS_UNLOCKED << 2) /**< Shifted mode UNLOCKED for PCNT_STATUS       */
#define PCNT_STATUS_PCNTLOCKSTATUS_LOCKED       (_PCNT_STATUS_PCNTLOCKSTATUS_LOCKED << 2)   /**< Shifted mode LOCKED for PCNT_STATUS         */
#define PCNT_STATUS_CNTRUNNING                  (0x1UL << 3)                                /**< Main Counter running status                 */
#define _PCNT_STATUS_CNTRUNNING_SHIFT           3                                           /**< Shift value for PCNT_CNTRUNNING             */
#define _PCNT_STATUS_CNTRUNNING_MASK            0x8UL                                       /**< Bit mask for PCNT_CNTRUNNING                */
#define _PCNT_STATUS_CNTRUNNING_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for PCNT_STATUS                */
#define PCNT_STATUS_CNTRUNNING_DEFAULT          (_PCNT_STATUS_CNTRUNNING_DEFAULT << 3)      /**< Shifted mode DEFAULT for PCNT_STATUS        */
#define PCNT_STATUS_AUXCNTRUNNING               (0x1UL << 4)                                /**< Aux Counter running status                  */
#define _PCNT_STATUS_AUXCNTRUNNING_SHIFT        4                                           /**< Shift value for PCNT_AUXCNTRUNNING          */
#define _PCNT_STATUS_AUXCNTRUNNING_MASK         0x10UL                                      /**< Bit mask for PCNT_AUXCNTRUNNING             */
#define _PCNT_STATUS_AUXCNTRUNNING_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for PCNT_STATUS                */
#define PCNT_STATUS_AUXCNTRUNNING_DEFAULT       (_PCNT_STATUS_AUXCNTRUNNING_DEFAULT << 4)   /**< Shifted mode DEFAULT for PCNT_STATUS        */

/* Bit fields for PCNT IF */
#define _PCNT_IF_RESETVALUE                     0x00000000UL                            /**< Default value for PCNT_IF                   */
#define _PCNT_IF_MASK                           0x0000001FUL                            /**< Mask for PCNT_IF                            */
#define PCNT_IF_UF                              (0x1UL << 0)                            /**< Underflow Interrupt Read Flag               */
#define _PCNT_IF_UF_SHIFT                       0                                       /**< Shift value for PCNT_UF                     */
#define _PCNT_IF_UF_MASK                        0x1UL                                   /**< Bit mask for PCNT_UF                        */
#define _PCNT_IF_UF_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for PCNT_IF                    */
#define PCNT_IF_UF_DEFAULT                      (_PCNT_IF_UF_DEFAULT << 0)              /**< Shifted mode DEFAULT for PCNT_IF            */
#define PCNT_IF_OF                              (0x1UL << 1)                            /**< Overflow Interrupt Read Flag                */
#define _PCNT_IF_OF_SHIFT                       1                                       /**< Shift value for PCNT_OF                     */
#define _PCNT_IF_OF_MASK                        0x2UL                                   /**< Bit mask for PCNT_OF                        */
#define _PCNT_IF_OF_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for PCNT_IF                    */
#define PCNT_IF_OF_DEFAULT                      (_PCNT_IF_OF_DEFAULT << 1)              /**< Shifted mode DEFAULT for PCNT_IF            */
#define PCNT_IF_DIRCNG                          (0x1UL << 2)                            /**< Direction Change Detect Interrupt Flag      */
#define _PCNT_IF_DIRCNG_SHIFT                   2                                       /**< Shift value for PCNT_DIRCNG                 */
#define _PCNT_IF_DIRCNG_MASK                    0x4UL                                   /**< Bit mask for PCNT_DIRCNG                    */
#define _PCNT_IF_DIRCNG_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for PCNT_IF                    */
#define PCNT_IF_DIRCNG_DEFAULT                  (_PCNT_IF_DIRCNG_DEFAULT << 2)          /**< Shifted mode DEFAULT for PCNT_IF            */
#define PCNT_IF_AUXOF                           (0x1UL << 3)                            /**< Auxiliary Overflow Interrupt Read Flag      */
#define _PCNT_IF_AUXOF_SHIFT                    3                                       /**< Shift value for PCNT_AUXOF                  */
#define _PCNT_IF_AUXOF_MASK                     0x8UL                                   /**< Bit mask for PCNT_AUXOF                     */
#define _PCNT_IF_AUXOF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for PCNT_IF                    */
#define PCNT_IF_AUXOF_DEFAULT                   (_PCNT_IF_AUXOF_DEFAULT << 3)           /**< Shifted mode DEFAULT for PCNT_IF            */
#define PCNT_IF_OQSTERR                         (0x1UL << 4)                            /**< Oversampling Quad State Err Int Flag        */
#define _PCNT_IF_OQSTERR_SHIFT                  4                                       /**< Shift value for PCNT_OQSTERR                */
#define _PCNT_IF_OQSTERR_MASK                   0x10UL                                  /**< Bit mask for PCNT_OQSTERR                   */
#define _PCNT_IF_OQSTERR_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for PCNT_IF                    */
#define PCNT_IF_OQSTERR_DEFAULT                 (_PCNT_IF_OQSTERR_DEFAULT << 4)         /**< Shifted mode DEFAULT for PCNT_IF            */

/* Bit fields for PCNT IEN */
#define _PCNT_IEN_RESETVALUE                    0x00000000UL                            /**< Default value for PCNT_IEN                  */
#define _PCNT_IEN_MASK                          0x0000001FUL                            /**< Mask for PCNT_IEN                           */
#define PCNT_IEN_UF                             (0x1UL << 0)                            /**< Underflow Interrupt Read Flag               */
#define _PCNT_IEN_UF_SHIFT                      0                                       /**< Shift value for PCNT_UF                     */
#define _PCNT_IEN_UF_MASK                       0x1UL                                   /**< Bit mask for PCNT_UF                        */
#define _PCNT_IEN_UF_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for PCNT_IEN                   */
#define PCNT_IEN_UF_DEFAULT                     (_PCNT_IEN_UF_DEFAULT << 0)             /**< Shifted mode DEFAULT for PCNT_IEN           */
#define PCNT_IEN_OF                             (0x1UL << 1)                            /**< Overflow Interrupt Read Flag                */
#define _PCNT_IEN_OF_SHIFT                      1                                       /**< Shift value for PCNT_OF                     */
#define _PCNT_IEN_OF_MASK                       0x2UL                                   /**< Bit mask for PCNT_OF                        */
#define _PCNT_IEN_OF_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for PCNT_IEN                   */
#define PCNT_IEN_OF_DEFAULT                     (_PCNT_IEN_OF_DEFAULT << 1)             /**< Shifted mode DEFAULT for PCNT_IEN           */
#define PCNT_IEN_DIRCNG                         (0x1UL << 2)                            /**< Direction Change Detect Interrupt Flag      */
#define _PCNT_IEN_DIRCNG_SHIFT                  2                                       /**< Shift value for PCNT_DIRCNG                 */
#define _PCNT_IEN_DIRCNG_MASK                   0x4UL                                   /**< Bit mask for PCNT_DIRCNG                    */
#define _PCNT_IEN_DIRCNG_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for PCNT_IEN                   */
#define PCNT_IEN_DIRCNG_DEFAULT                 (_PCNT_IEN_DIRCNG_DEFAULT << 2)         /**< Shifted mode DEFAULT for PCNT_IEN           */
#define PCNT_IEN_AUXOF                          (0x1UL << 3)                            /**< Auxiliary Overflow Interrupt Read Flag      */
#define _PCNT_IEN_AUXOF_SHIFT                   3                                       /**< Shift value for PCNT_AUXOF                  */
#define _PCNT_IEN_AUXOF_MASK                    0x8UL                                   /**< Bit mask for PCNT_AUXOF                     */
#define _PCNT_IEN_AUXOF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for PCNT_IEN                   */
#define PCNT_IEN_AUXOF_DEFAULT                  (_PCNT_IEN_AUXOF_DEFAULT << 3)          /**< Shifted mode DEFAULT for PCNT_IEN           */
#define PCNT_IEN_OQSTERR                        (0x1UL << 4)                            /**< Oversampling Quad State Err Int Flag        */
#define _PCNT_IEN_OQSTERR_SHIFT                 4                                       /**< Shift value for PCNT_OQSTERR                */
#define _PCNT_IEN_OQSTERR_MASK                  0x10UL                                  /**< Bit mask for PCNT_OQSTERR                   */
#define _PCNT_IEN_OQSTERR_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for PCNT_IEN                   */
#define PCNT_IEN_OQSTERR_DEFAULT                (_PCNT_IEN_OQSTERR_DEFAULT << 4)        /**< Shifted mode DEFAULT for PCNT_IEN           */

/* Bit fields for PCNT CNT */
#define _PCNT_CNT_RESETVALUE                    0x00000000UL                            /**< Default value for PCNT_CNT                  */
#define _PCNT_CNT_MASK                          0x0000FFFFUL                            /**< Mask for PCNT_CNT                           */
#define _PCNT_CNT_CNT_SHIFT                     0                                       /**< Shift value for PCNT_CNT                    */
#define _PCNT_CNT_CNT_MASK                      0xFFFFUL                                /**< Bit mask for PCNT_CNT                       */
#define _PCNT_CNT_CNT_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for PCNT_CNT                   */
#define PCNT_CNT_CNT_DEFAULT                    (_PCNT_CNT_CNT_DEFAULT << 0)            /**< Shifted mode DEFAULT for PCNT_CNT           */

/* Bit fields for PCNT AUXCNT */
#define _PCNT_AUXCNT_RESETVALUE                 0x00000000UL                            /**< Default value for PCNT_AUXCNT               */
#define _PCNT_AUXCNT_MASK                       0x0000FFFFUL                            /**< Mask for PCNT_AUXCNT                        */
#define _PCNT_AUXCNT_AUXCNT_SHIFT               0                                       /**< Shift value for PCNT_AUXCNT                 */
#define _PCNT_AUXCNT_AUXCNT_MASK                0xFFFFUL                                /**< Bit mask for PCNT_AUXCNT                    */
#define _PCNT_AUXCNT_AUXCNT_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for PCNT_AUXCNT                */
#define PCNT_AUXCNT_AUXCNT_DEFAULT              (_PCNT_AUXCNT_AUXCNT_DEFAULT << 0)      /**< Shifted mode DEFAULT for PCNT_AUXCNT        */

/* Bit fields for PCNT TOP */
#define _PCNT_TOP_RESETVALUE                    0x000000FFUL                            /**< Default value for PCNT_TOP                  */
#define _PCNT_TOP_MASK                          0x0000FFFFUL                            /**< Mask for PCNT_TOP                           */
#define _PCNT_TOP_TOP_SHIFT                     0                                       /**< Shift value for PCNT_TOP                    */
#define _PCNT_TOP_TOP_MASK                      0xFFFFUL                                /**< Bit mask for PCNT_TOP                       */
#define _PCNT_TOP_TOP_DEFAULT                   0x000000FFUL                            /**< Mode DEFAULT for PCNT_TOP                   */
#define PCNT_TOP_TOP_DEFAULT                    (_PCNT_TOP_TOP_DEFAULT << 0)            /**< Shifted mode DEFAULT for PCNT_TOP           */

/* Bit fields for PCNT TOPB */
#define _PCNT_TOPB_RESETVALUE                   0x000000FFUL                            /**< Default value for PCNT_TOPB                 */
#define _PCNT_TOPB_MASK                         0x0000FFFFUL                            /**< Mask for PCNT_TOPB                          */
#define _PCNT_TOPB_TOPB_SHIFT                   0                                       /**< Shift value for PCNT_TOPB                   */
#define _PCNT_TOPB_TOPB_MASK                    0xFFFFUL                                /**< Bit mask for PCNT_TOPB                      */
#define _PCNT_TOPB_TOPB_DEFAULT                 0x000000FFUL                            /**< Mode DEFAULT for PCNT_TOPB                  */
#define PCNT_TOPB_TOPB_DEFAULT                  (_PCNT_TOPB_TOPB_DEFAULT << 0)          /**< Shifted mode DEFAULT for PCNT_TOPB          */

